{
    "es": {
        "home": "Inicio",
        "dark": "Oscuro 🌙",
        "light": "Claro ☀️",
        "lan": "EN",
        "welcome": "Bienvenido a mi portafolio",
        "intro": "¡Hola! Soy Daniel Seregin Kozlov. Durante la <strong>CARRERA DE COMERCIO</strong>, aunque inicialmente no sabía exactamente a qué quería dedicarme, fue allí cuando descubrí mi verdadera pasión: la programación. Al darme cuenta de que era lo que realmente me motivaba, decidí terminar LA <strong>CARRERA DE COMERCIO</strong> y luego estudiar el <strong>DESAROLLO DE APLICACIONES MULTIPLATAFORMA</strong>, donde logré una <strong>MENCIÓN HONORÍFICA</strong> por mi trabajo de fin de grado. Mi lenguaje principal es <strong>JAVA</strong>, pero también tengo experiencia con <strong>PYTHON</strong> y <strong>JAVASCRIPT</strong>, gracias a cursos y autoaprendizaje. Además, he trabajado con <strong>SPRING</strong> y <strong>DJANGO</strong>, lo que me permite crear aplicaciones tanto en el <strong>BACKEND</strong> como en el <strong>FRONTEND</strong>. Mi motivación es seguir aprendiendo y enfrentarme a nuevos desafíos que me permitan crecer como programador. Me encanta resolver problemas reales mediante soluciones eficientes y escalables. Siempre busco mejorar mis habilidades y explorar nuevas tecnologías que me ayuden a llevar mis proyectos al siguiente nivel. Además, tengo la suerte de hablar <strong>RUSO</strong> como lengua materna, <strong>INGLÉS</strong> con un nivel avanzado y <strong>CASTELLANO</strong> de manera fluida, lo que me permite trabajar y comunicarme en diferentes entornos internacionales. Estoy muy motivado para seguir desarrollándome como programador y contribuir a proyectos que marquen una diferencia.",
        "projects": "Proyectos",
        "viewCode": "Ver código",
        "project1": "API para una web con Spring",
        "p1info": "Junto a un compañero, creamos una web para una ONG, mi parte del proyecto fue el backend, la creación de la API.",
        "project2": "Animanga Universe (Android)",
        "p2info": "El trabajo del fin de grado del grado superior, una alternativa a aplicaciones como MyAnimeList y MyAnimePlanet",
        "project3": "Aplicación web con Django",
        "p3info": "Proyecto final de un curso ofrecido por la universidad de Harvard de programación web con Python y JavaScript",
        "project4": "Proyecto SQL",
        "p4info": "Proyecto final de bases de datos, para la creación de una base de datos completa de un centro de ciclos formativos",
        "project5": "Organización de archivos",
        "p5info": "Programa que organiza los archivos de una forma determinada, a la vez trabajando con una base de datos.",
        "project6": "Más proyectos",
        "p6info": "Trabajando en proyectos nuevos y mejorando continuamente.",
        "more": "Más...",
        "cv": "CV",
        "myCV": "Mi CV",
        "downloadCV": "Descargar CV",
        "skills": "Habilidades técnicas",
        "languages": "Lenguajes",
        "frameworks": "Frameworks",
        "db": "Bases de datos",
        "tools": "Herramientas",
        "versionControl": "Control de versiones",
        "markUp": "Marcado y estilos",
        "contact": "Contacto",
        "certificates": "Certificados",
        "seeCertificate": "Ver certificado"
    
    },
    "en":{
        "home": "Home",
        "dark": "Dark 🌙",
        "light": "Light ☀️",
        "lan": "ES",
        "welcome": "Welcome to my portfolio",
        "intro": "Hello! I'm Daniel Seregin Kozlov. During my <strong>COMMERCE DEGREE</strong>, although I didn't know exactly what I wanted to do, it was there when I discovered my true passion: programming. Realizing that it was what really motivated me, I decided to finish my <strong>COMMERCE DEGREE</strong> and then study <strong>MULTIPLATFORM APPICATION DEVELOPMENT</strong>, where I achieved an <strong>HONORIFIC MENTION</strong> for my final degree project. My main language is <strong>JAVA</strong>, but I also have experience with <strong>PYTHON</strong> and <strong>JAVASCRIPT</strong>, thanks to courses and self-learning. In addition, I have worked with <strong>SPRING</strong> and <strong>DJANGO</strong>, which allows me to create applications both in the <strong>BACKEND</strong> and in the <strong>FRONTEND</strong>. My motivation is to continue learning and face new challenges that allow me to grow as a programmer. I love solving real problems through efficient and scalable solutions. I always seek to improve my skills and explore new technologies that help me take my projects to the next level. Also, I speak fluently in 3 languages: <strong>ENGLISH</strong>, <strong>RUSSIAN</strong> and <strong>SPANISH</strong>, which allows me to work and communicate in different international environments. I am very motivated to continue developing as a programmer and contribute to projects that make a difference.",
        "projects": "Projects",
        "viewCode": "View code",
        "project1": "API for a web with Spring",
        "p1info": "Together with a partner, we created a website for an NGO, my part of the project was the backend, the creation of the API.",
        "project2": "Animanga Universe (Android)",
        "p2info": "The work of the end of the higher degree, an alternative to applications like MyAnimeList and MyAnimePlanet",
        "project3": "Web application with Django",
        "p3info": "Final project of a course offered by Harvard University on web programming with Python and JavaScript",
        "project4": "SQL project",
        "p4info": "Final project of databases, for the creation of a complete database of a center of vocational training",
        "project5": "File organization",
        "p5info": "Program that organizes files in a certain way, while working with a database.",
        "project6": "More projects",
        "p6info": "Working on new projects and improving day by day.",
        "more": "More...",
        "cv": "CV",
        "myCV": "My CV",
        "downloadCV": "Download CV",
        "skills": "Technical Skills",
        "languages": "Languages",
        "frameworks": "Frameworks",
        "db": "Databases",
        "tools": "Tools",
        "versionControl": "Version control",
        "markUp": "Markup and styling",
        "contact": "Contact",
        "certificates": "Certificates",
        "seeCertificate": "See certificate"
    }
}